
//And the foundations of the wall of the city were garnished with all manner of precious stones.
//The first foundation was jasper; the second, sapphire; the third, a chalcedony; the fourth, an emerald (Revelation 21:19)

/*
Тетрис(9)

Если ты обратил внимание, мы пишем программу "сверху вниз".

Сначала решили, какие классы нам нужны. Затем - какие методы.

А потом уже начнем писать код этих методов.

Таким образом мы разбиваем большую задачу на множество маленьких.

Когда код всех методов будет готов, останется только проверить - так ли все работает, как должно быть.

И если надо - внести некоторые изменения.





Требования:

1. Пересмотри созданную структуру классов и обрати внимание на порядок написания программы.
*/
